# PromptForFamilyInstancePlacement Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UIDocument..::..PromptForFamilyInstancePlacement Method
UIDocument Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PromptForFamilyInstancePlacement(FamilySymbol) | Prompts the user to place instances of the specified FamilySymbol. |
| PromptForFamilyInstancePlacement(FamilySymbol, PromptForFamilyInstancePlacementOptions) | Prompts the user to place instances of the specified FamilySymbol. |

# See Also
UIDocument Class
UIDocument Members
Autodesk.Revit.UI Namespace